/**
 * 题目:
 * 请你来实现一个 atoi 函数，使其能将字符串转换成整数
 * 首先，该函数会根据需要丢弃无用的开头空格字符，直到寻找到第一个非空格的字符为止
 * 当我们寻找到的第一个非空字符为正或者负号时，则将该符号与之后面尽可能多的连续数字组合起来，作为该整数的正负号；假如第一个非空字符是数字，则直接将其与之后连续的数字字符组合起来，形成整数
 * 该字符串除了有效的整数部分之后也可能会存在多余的字符，这些字符可以被忽略，它们对于函数不应该造成影响
 * 注意：假如该字符串中的第一个非空格字符不是一个有效整数字符、字符串为空或字符串仅包含空白字符时，则你的函数不需要进行转换
 * 在任何情况下，若函数不能进行有效的转换时，请返回 0
 *
 * 说明:
 * 假设我们的环境只能存储 32 位大小的有符号整数，那么其数值范围为 [−2^31,  2^31 − 1]。如果数值超过这个范围，请返回  INT_MAX (2^31 − 1) 或 INT_MIN (−2^31)
 *
 * 示例 1:
 * 输入: "42"
 * 输出: 42
 *
 * 示例 2:
 * 输入: " -42"
 * 输出: -42
 *
 * 示例 3:
 * 输入: "4193 with words"
 * 输出: 4193
 *
 * 示例 4:
 * 输入: "words and 987"
 * 输出: 0
 *
 * 示例 5:
 * 输入: "-91283472332"
 * 输出: -2147483648
 */

export const myAtoi = (str: string) => {
  /**
   * \s* 匹配 0次或者 多次 空格
   * () 捕获分组
   * [-/+] 只有出现 [] 中的一个就行
   * ? 0次 或 1次
   * [0-9]* 多个数字
   * .* 任意字符多次
   */
  const reg = /\s*([-/+]?[0-9]*).*/;
  const max = Math.pow(2, 31) - 1; // 处理大于最大值 返回最大值
  const min = -Math.pow(2, 31) - 1; // 处理小于最小值 返回最小值
  let result = 0; // 默认值

  const groups = str.match(reg); // 获取匹配的组

  if (groups) {
    result += Number(groups[1]);
    if (isNaN(result)) {
      result = 0;
    }
  }
  result = result > max ? max : result;
  result = result < min ? min : result;
  return result;
};
